Revit 2024 API
CurveLoop.CreateViaOffset Method
Overload List
Name | Description
CreateViaOffset(CurveLoop, IList<Double>, XYZ)
 Creates a new curve loop that is an offset of the existing curve loop.
CreateViaOffset(CurveLoop, Double, XYZ)
 Creates a new curve loop that is an offset of the existing curve loop.
See Also
CurveLoop Class
CurveLoop Members
Autodesk.Revit.DB Namespace